
create table location(
    id integer primary key,
    set_name varchar(255),
    lang varchar(2),
    location varchar(255),
    roles varchar(300),
    filename varchar(500),
    file_id varchar(255)
);


create table round(
    id integer primary key,
    game_id integer,
    round_nbr integer,
    started datetime,
    finished datetime,
    location_id integer,
    spy_id integer,
    winner_type varchar(12),
    details varchar(300)
    FOREIGN KEY(location_id) REFERENCES location(id)
);


create table log(
    datetime_stamp datetime,
    user_id integer,
    game_id varchar(255),
    action varchar(10)
);

insert into location (id, set_name, lang, location, roles, filename, file_id)
values
    ("1","Основной","RU","Ресторан","музыкант, посетитель, вышибала, метрдотель, шеф-повар, официант, критик","restaurant.jpg",""),
    ("2","Основной","RU","Спа-салон","клиент, стилист, массажист, визажист, маникюрщик, косметолог, дерматолог","",""),
    ("3","Основной","RU","Отель","бармен, постоялец, горничная, швейцар, охранник, управляющий, портье","",""),
    ("4","Основной","RU","Университет","студент, вахтёр, ректор, профессор, аспирант, психолог, декан","",""),
    ("5","Основной","RU","Банк","клиент, охранник, грабитель, кассир, управляющий, инкассатор, консультант","",""),
    ("6","Основной","RU","Больница","терапевт, хирург, медсестра, пациент, патологоанатом, главврач, интерн","",""),
    ("7","Основной","RU","Посольство","дипломат, посол, чиновник, секретарь, охранник, турист, беженец","",""),
    ("8","Основной","RU","Киностудия","звукооператор, каскадёр, оператор, костюмер, режиссёр, актёр, статист","",""),
    ("9","Основной","RU","Цирк-шапито","дрессировщик, посетитель, фокусник, жонглёр, клоун, метатель ножей, акробат","",""),
    ("10","Основной","RU","Театр","гардеробщик, суфлёр, билетёр, зритель, режиссёр, актёр, рабочий сцены","",""),
    ("11","Основной","RU","Церковь","священник, грешник, хорист, прихожанин, нищий, турист, меценат","",""),
    ("12","Основной","RU","Овощебаза","санинспектор, охранник, грузчик, бухгалтер, бригадир, лаборант, водитель","",""),
    ("13","Основной","RU","Супермаркет","мерчендайзер, охранник, промоутер, кассир, мясник, уборщик, покупатель","",""),
    ("14","Основной","RU","Полицейский участок","журналист, детектив, адвокат, криминалист, архивариус, патрульный, преступник","",""),
    ("15","Основной","RU","Корпоративная вечеринка","менеджер, ведущий, незваный гость, шеф, секретарь, бухгалтер, курьер","",""),
    ("16","Основной","RU","Океанский лайнер","богатый пассажир, стюард, капитан, бармен, музыкант, кок, радист","",""),
    ("17","Основной","RU","Подводная лодка","электромеханик, матрос, командир, штурман, гидроакустик, кок, радист","",""),
    ("18","Основной","RU","Станция техобслуживания","мастер-приёмщик, шиномонтажник, мойщик, мотоциклист, электрик, директор, автомобилист","",""),
    ("19","Основной","RU","Полярная станция","начальник экспедиции, геофизик, биолог, метеоролог, медик, гидролог, радист","",""),
    ("20","Основной","RU","Пляж","фотограф с обезьянкой, аниматор, отдыхающий, парапланерист, разносчик еды, спасатель, вор","",""),
    ("21","Основной","RU","Воинская часть","продавец в магазине, младший офицер, врач, караульный, рядовой, полковник, дезертир","",""),
    ("22","Основной","RU","Войско крестоносцев","плененный сарацин, слуга, епископ, лучник, монах, оруженосец, рыцарь","",""),
    ("23","Основной","RU","Пассажирский поезд","разносчик товаров, повар вагоне-ресторана, пассажир, пограничник, проводник, машинист, кочегар","",""),
    ("24","Основной","RU","Школа","классный руководитель, охранник, физрук, школьник, директор, уборщик, завуч","",""),
    ("25","Основной","RU","База террористов","мальчик на побегушках, глава ячейки, боевик, смертник, медик, новобранец, пастух","",""),
    ("26","Основной","RU","Партизанский отряд","пленный полицай, разведчик, партизан, радист, медик, солдат, повар","",""),
    ("27","Основной","RU","Казино","азартный посетитель, начальник охраны, вышибала, шулер, бармен, администратор, крупье","",""),
    ("28","Основной","RU","Пиратский корабль","связанный пленник, канонир, матрос, юнга, капитан, кок, раб","",""),
    ("29","Основной","RU","Орбитальная станция","космический турист, инженер-исследователь, инженер-исслед., врач, пилот, командир, инопланетянин","",""),
    ("30","Основной","RU","Самолёт","командир экипажа, пассажир бизнес-класса, эконом-класса, стюард, второй пилот, бортинженер, безбилетник","","");


insert into location (set_name, lang, location, roles, filename, file_id)
values
    ("Основной с эмодзи","RU","🍽️ Ресторан","музыкант 🎵, посетитель 👤, вышибала 💂‍♂️, метрдотель 🎩, шеф-повар 👨‍🍳, официант 🍽️, критик 👩‍⚖️","",""),
    ("Основной с эмодзи","RU","💆‍♀️ Спа-салон","клиент 👤, стилист 💇‍♀️, массажист 💆‍♀️, визажист 💄, маникюрщик 💅, косметолог 💆, дерматолог 🩺","",""),
    ("Основной с эмодзи","RU","🏨 Отель","бармен 🍸, постоялец 👤, горничная 🛎️, швейцар 🎩, охранник 💂‍♂️, управляющий 💼, портье 🚪","",""),
    ("Основной с эмодзи","RU","🎓 Университет","студент 👨‍🎓, вахтёр 👷‍♂️, ректор 👨‍💼, профессор 👨‍🏫, аспирант 🎓, психолог 🧑‍🔬, декан 👨‍⚖️","",""),
    ("Основной с эмодзи","RU","🏦 Банк","клиент 👤, охранник 💂‍♂️, грабитель 👥, кассир 💰, управляющий 💼, инкассатор 🚚, консультант 🤝","",""),
    ("Основной с эмодзи","RU","🏥 Больница","терапевт 🩺, хирург 🏥, медсестра 👩‍⚕️, пациент 👤, патологоанатом 🧪, главврач 👨‍⚕️, интерн 👨‍⚕️","",""),
    ("Основной с эмодзи","RU","🏛️ Посольство","дипломат 🤵, посол 🌍, чиновник 🕴️, секретарь 💼, охранник 💂‍♂️, турист 🧳, беженец 🏃‍♂️","",""),
    ("Основной с эмодзи","RU","🎬 Киностудия","звукооператор 🎤, каскадёр 🤸‍♂️, оператор 🎥, костюмер 👗, режиссёр 🎬, актёр 🎭, статист 🙋‍♂️","",""),
    ("Основной с эмодзи","RU","🎪 Цирк-шапито","дрессировщик 🎪, посетитель 👤, фокусник 🎩, жонглёр 🤹‍♂️, клоун 🤡, метатель ножей 🗡️, акробат 🤸‍♀️","",""),
    ("Основной с эмодзи","RU","🎭 Театр","гардеробщик 👘, суфлёр 🗣️, билетёр 🎫, зритель 👥, режиссёр 🎬, актёр 🎭, рабочий сцены 🛠️","",""),
    ("Основной с эмодзи","RU","⛪ Церковь","священник ⛪, грешник 😈, хорист 🎤, прихожанин 🙏, нищий 🚮, турист 🧳, меценат 💰","",""),
    ("Основной с эмодзи","RU","🥦 Овощебаза","санинспектор 🛷, охранник 💂‍♂️, грузчик 📦, бухгалтер 📊, бригадир 👨‍🏭, лаборант 🧪, водитель 🚚","",""),
    ("Основной с эмодзи","RU","🛒 Супермаркет","мерчендайзер 🛍️, охранник 💂‍♂️, промоутер 📣, кассир 💰, мясник 🥩, уборщик 🧹, покупатель 👤","",""),
    ("Основной с эмодзи","RU","🚓 Полицейский участок","журналист 🗞️, детектив 🕵️‍♂️, адвокат 🧑‍⚖️, криминалист 🔍, архивариус 🗃️, патрульный 🚔, преступник 👥","",""),
    ("Основной с эмодзи","RU","🎉 Корпоративная вечеринка","менеджер 💼, ведущий 🎤, незваный гость 👥, шеф 👨‍🍳, секретарь 💼, бухгалтер 📊, курьер 🚚","",""),
    ("Основной с эмодзи","RU","🛳️ Океанский лайнер","богатый пассажир 💰, стюард ✈️, капитан ⚓, бармен 🍸, музыкант 🎵, кок 🧑‍🍳, радист 📻","",""),
    ("Основной с эмодзи","RU","🚤 Подводная лодка","электромеханик 🔧, матрос ⚓, командир ⚓, штурман 🧭, гидроакустик 🎛️, кок 🧑‍🍳, радист 📻","",""),
    ("Основной с эмодзи","RU","🔧 Станция техобслуживания","мастер-приёмщик 🛠️, шиномонтажник 🚗, мойщик 🧽, мотоциклист 🏍️, электрик ⚡, директор 💼, автомобилист 🚗","",""),
    ("Основной с эмодзи","RU","🏔️ Полярная станция","начальник экспедиции 🌍, геофизик 🌋, биолог 🌿, метеоролог 🌦️, медик 🩺, гидролог 🌊, радист 📻","",""),
    ("Основной с эмодзи","RU","🏖️ Пляж","фотограф с обезьянкой 🐒, аниматор 🤡, отдыхающий 🧘‍♂️, парапланерист 🪂, разносчик еды 🚲, спасатель 🚑, вор 👥","",""),
    ("Основной с эмодзи","RU","🏰 Воинская часть","продавец в магазине 🛍️, младший офицер 🎖️, врач 🩺, караульный 🎖️, рядовой 👥, полковник 🎖️, дезертир 👥","",""),
    ("Основной с эмодзи","RU","⚔️ Войско крестоносцев","плененный сарацин 👳, слуга 🧹, епископ ⛪, лучник 🏹, монах 👤, оруженосец ⚔️, рыцарь 🤺","",""),
    ("Основной с эмодзи","RU","🚂 Пассажирский поезд","разносчик товаров 📦, повар вагоне-ресторана 👨‍🍳, пассажир 👤, пограничник 👮‍♂️, проводник 👮‍♀️, машинист 🚂, кочегар 🔥","",""),
    ("Основной с эмодзи","RU","🏫 Школа","классный руководитель 👩‍🏫, охранник 💂‍♂️, физрук 🏋️‍♂️, школьник 👦, директор 👩‍💼, уборщик 🧹, завуч 👩‍🏫","",""),
    ("Основной с эмодзи","RU","💣 База террористов","мальчик на побегушках 👦, глава ячейки 👥, боевик 👥, смертник 💣, медик 🚑, новобранец 👥, пастух 🐑","",""),
    ("Основной с эмодзи","RU","🔫 Партизанский отряд","пленный полицай 👮‍♂️, разведчик 🕵️‍♂️, партизан 👥, радист 📻, медик 🩺, солдат 🎖️, повар 👨‍🍳","",""),
    ("Основной с эмодзи","RU","🎰 Казино","азартный посетитель 🎰, начальник охраны 💂‍♂️, вышибала 💪, шулер 🎴, бармен 🍹, администратор 💼, крупье 🃏","",""),
    ("Основной с эмодзи","RU","🏴‍☠️ Пиратский корабль","связанный пленник 👥, канонир 💣, матрос ⚓, юнга 👦, капитан ⚓, кок 🧑‍🍳, раб 👥","",""),
    ("Основной с эмодзи","RU","🛰️ Орбитальная станция","космический турист 🚀, инженер-исследователь 👩‍🔬, инженер-исслед. 👨‍🔬, врач 🩺, пилот ✈️, командир 🚀, инопланетянин 👽","",""),
    ("Основной с эмодзи","RU","✈️ Самолёт","командир экипажа ✈️, пассажир бизнес-класса 👤, эконом-класса 👤, стюард ✈️, второй пилот ✈️, бортинженер ✈️, безбилетник 👥","","");

